In [26]:
import pandas as pd
import numpy as np

# So now we have imported all our initial packages

In [27]:
data = pd.read_csv("G:\Data_Sets\mall_customers.csv")

In [28]:
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

# We got our data inserted

In [29]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

No empty slot present

In [30]:
print(data.columns)
data.dtypes

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [31]:
from sklearn import preprocessing 
from sklearn.preprocessing import LabelEncoder
le = preprocessing.LabelEncoder()
le.fit(data["Gender"].astype(str))
list(le.classes_)
df = data.astype(str).apply(le.fit_transform)
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           0       1    1                   6                      24
1         111       1    3                   6                      66
2         123       0    2                   7                      47
3         134       0    5                   7                      62
4         145       0   13                   8                      26

In [32]:
print(df.columns)
df.dtypes

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

CustomerID                int32
Gender                    int32
Age                       int32
Annual Income (k$)        int32
Spending Score (1-100)    int32
dtype: object

So, now using Label encoder we encoded the Gender segregates to 1 and 0

In [33]:
df.describe()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100)
count,200.000000,200.000000,200.000000,200.000000,200.000000
mean,99.500000,0.440000,20.680000,33.480000,39.940000
std,57.879185,0.497633,13.636251,17.360777,21.798446
min,0.000000,0.000000,0.000000,0.000000,0.000000
25%,49.750000,0.000000,10.750000,19.750000,25.750000
50%,99.500000,0.000000,18.000000,33.500000,38.000000
75%,149.250000,1.000000,31.000000,48.000000,58.000000
max,199.000000,1.000000,50.000000,63.000000,83.000000

# Sorting and Filtering

In [34]:
temp = df.sort_values(by = ["Annual Income (k$)","Spending Score (1-100)"], ascending=False)
temp.head()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
185          96       1   12                  63                      81
184          95       0   23                  63                      24
183          94       0   11                  62                      72
182          93       1   28                  62                       6
181          92       0   14                  61                      70

In [35]:
df[(df["Gender"]==1) & (df["Spending Score (1-100)"]>70)].head()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
33          128       1    0                  19                      77
41          137       1    6                  22                      77
123          28       1   21                  44                      76
127          32       1   22                  46                      80
130          36       1   29                  46                      74

Cumulative Sum of Gender,Age,Annual income, Spending Score

In [36]:
df.apply(np.cumsum).tail(1).drop("CustomerID", axis = 1)

     Gender   Age  Annual Income (k$)  Spending Score (1-100)
199      88  4136                6696                    7988

In [37]:
pd.pivot_table(data, columns = "Gender", index = ["Annual Income (k$)","Spending Score (1-100)","Age"] , aggfunc=np.all).fillna("False")

                                              CustomerID
Gender                                            Female   Male
Annual Income (k$) Spending Score (1-100) Age
15                 39                     19       False   True
                   81                     21       False   True
16                 6                      20        True  False
                   77                     23        True  False
17                 40                     31        True  False
...                                                  ...    ...
120                79                     35        True  False
126                28                     45        True  False
                   74                     32       False   True
137                18                     32       False   True
                   83                     30       False   True

[200 rows x 2 columns]